//  21 задача
let a_21_1 = (2 + 3) * (2 + 3);
alert(a_21_1); // выведет 25

let a_21_2 = (2 + 3) * 2 + 3;
alert(a_21_2); // выведет 13

let a_21_3 = 2 * (2 + 4 * (3 + 1));
alert(a_21_3); // выведет 36

let a_21_4 = 2 * 8 / 4;
alert(a_21_4); // выведет 4

let a_21_5 = (2 * 8) / 4;
alert(a_21_5); // выведет 4

let a_21_6 = 2 * (8 / 4);
alert(a_21_6); // выведет 4

// 22 задача
let a_22 = 1.5, b_22 = 0.75;
let result_22 = a_22 + b_22;
alert(result_22);

// 23 задача
let a_23_1 = -100;
alert(a_23_1);

let a_23_2 = -12;
alert(-a_23_2);