// 11 задача
alert('Привет, мир') // привет мир
/*
комментарий
*/

// 13 задача
let num;
num = 123;
alert(num);

// 14 задача
let o = 1;
let b = 2;
let c = 3;

let d = 4, f = 5, g = 6;

let e, i, k;
e = 7;
i = 8;
k = 9;

// 15 задача
let a;
a = 10;
alert(a);

a = 20;
alert(a);

// 16 задача
let a_16 = 1 + 2 + 3;
alert(a_16);

// 18 задача
let a_18_1 = 10;
let b_18_1 = 2;
alert(a_18_1 + b_18_1);
alert(a_18_1 - b_18_1);
alert(a_18_1 * b_18_1);
alert(a_18_1 / b_18_1);

let c_18_2 = 10;
let d_18_2 = 5;
let result_18_2 = c_18_2 + d_18_2;
alert(result_18_2);

let a_18_3 = 1;
let b_18_3 = 2;
let c_18_3 = 3;
alert(a_18_3 + b_18_3 + c_18_3);

let a_18_4 = 10, b_18_4 = 5;
let c_18_4 = a_18_4 - b_18_4;
let d_18_4 = 7;
let result_18_4 = c_18_4 + d_18_4;
alert(result_18_4);

// 19 задача
let a_19_1 = 5 + 5 * 3;
alert(a_19_1); // выведет 20 (результат 5 + 15)

let a_19_2 = 5 + 5 * 3 + 3;
alert(a_19_2); // выведет 23 (результат 20 + 3)

let a_19_3 = 8 / 2 + 2;
alert(a_19_3); // выведет 6 (результат 4 + 2)

let a_19_4 = 8 + 2 / 2;
alert(a_19_4); // выведет 9 (результат 8 + 1)

// 20 задача
let a_20_1 = 8 / 2 * 2;
alert(a_20_1); // выведет 8

let a_20_2 = 8 * 4 / 2 / 2;
alert(a_20_2); // выведет 8